In [1]:
import sqlite3
import sqlalchemy
import pandas as pd

In [2]:
engine = sqlalchemy.create_engine('sqlite:///mydb.db')

In [6]:
pd.read_sql('select * from employees',engine)

     name     surname    salary
0   Maria       Mayer  100000.0
1     Max     Maxwell  100000.0
2    King      Arthur   50000.0
3  Jerome  Washington  100000.0

In [7]:
df1 = pd.DataFrame([{'name':'john','surname':'deer','salary':75000}])

In [8]:
df1.to_sql('employees',engine, if_exists='append',index=False)

In [12]:
import yfinance as yf

In [13]:
df = yf.download('GME',start='2021-01-01')

[*********************100%***********************]  1 of 1 completed

In [15]:
df.to_sql('GME',engine)

In [16]:
pd.read_sql('GME',engine)

,Date,Open,High,Low,Close,Adj Close,Volume
0,2021-01-04,19.000000,19.100000,17.150000,17.250000,17.250000,10022500
1,2021-01-05,17.350000,18.080000,17.230000,17.370001,17.370001,4961500
2,2021-01-06,17.340000,18.980000,17.330000,18.360001,18.360001,6056200
3,2021-01-07,18.469999,19.450001,18.020000,18.080000,18.080000,6129300
4,2021-01-08,18.180000,18.299999,17.080000,17.690001,17.690001,6482000
...,...,...,...,...,...,...,...
244,2021-12-21,157.059998,160.250000,155.139999,158.119995,158.119995,1430200
245,2021-12-22,158.330002,159.149994,152.119995,154.000000,154.000000,1047200
246,2021-12-23,154.000000,155.000000,146.020004,152.139999,152.139999,1053100
247,2021-12-27,152.000000,152.619995,140.000000,148.309998,148.309998,1613600
248,2021-12-28,147.500000,157.410004,146.410004,146.460007,146.460007,1320244